#                                      Pandas Practice and my notes:

Pandas is a library in python, which helps us to read, write dataframes and read various types of files to python.

 It also has merges and joins which helps us to perform data analysis.
 
 To import this library we use following code:

In [4]:
#importing pandas:

import pandas as pd

### Reading a file as dataframe in pandas:

Different types of fiels can be read in pandas

Here is code format to read some of the files

In [32]:
# read csv,excel,json and other type of files:
df = pd.read_csv(r'C:\Users\Ravi Teja\Desktop\Datasets\Bike-Sharing-Dataset\train.csv')  

#df= pd.read_csv('**file location**')
#df = pd.read_excel('**file location**')
#df = pd.read_json('**file location**')
#df = pd.read_sql('**file location**')
#df = pd.read_sql_query('**file location**')

### Other functions:

    # df.shape() - gives number of rows and columns
    # df.columns - gives columns
    # df.head() -  gives a small preview of top few rows 
    #df.tail() -   gives a small preview of bottom few rows

In [9]:
# to know number of coloumns, shape, head, type of dataframe:

df.shape
df.columns
df.head()
df.tail()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

### Data summary:

These below functions help us to know about the type of the data, null values in the data and other insights about the dataset

In [10]:
 #summarization functions:
    
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
datetime      10886 non-null object
season        10886 non-null int64
holiday       10886 non-null int64
workingday    10886 non-null int64
weather       10886 non-null int64
temp          10886 non-null float64
atemp         10886 non-null float64
humidity      10886 non-null int64
windspeed     10886 non-null float64
casual        10886 non-null int64
registered    10886 non-null int64
count         10886 non-null int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.6+ KB

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
count,10886.000000,10886.000000,10886.000000,10886.000000,10886.00000,10886.000000,10886.000000,10886.000000,10886.000000,10886.000000,10886.000000
mean,2.506614,0.028569,0.680875,1.418427,20.23086,23.655084,61.886460,12.799395,36.021955,155.552177,191.574132
std,1.116174,0.166599,0.466159,0.633839,7.79159,8.474601,19.245033,8.164537,49.960477,151.039033,181.144454
min,1.000000,0.000000,0.000000,1.000000,0.82000,0.760000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,0.000000,1.000000,13.94000,16.665000,47.000000,7.001500,4.000000,36.000000,42.000000
50%,3.000000,0.000000,1.000000,1.000000,20.50000,24.240000,62.000000,12.998000,17.000000,118.000000,145.000000
75%,4.000000,0.000000,1.000000,2.000000,26.24000,31.060000,77.000000,16.997900,49.000000,222.000000,284.000000
max,4.000000,1.000000,1.000000,4.000000,41.00000,45.455000,100.000000,56.996900,367.000000,886.000000,977.000000

### Writing data into dataframe:

The general format is as below code. Just have to write the logic.

In [ ]:
#adding new  column named 'id':

df['id']= #write your logic here

### Subsetting the data: 

There are many ways to subset the data. 

    # We can just give df['*name of the column*'] if we want just one column.
    # We can give df[['column1','column2']] as list for 2 or more columns

In [ ]:
#subsetting data:

#only one column

df['count']

### Subsetting the Data

We can also use loc,iloc for subsetting data with both rows and columns. please refer below code for further clarity

In [ ]:
#multiple columns: use loc, iloc
#iloc - index based
#loc - not index based

df.iloc[0] - #gives the first row of all columns

df.iloc[0,0] - #gives first row first column

df.iloc[0,3] - #gives first row fourth column

df.iloc[0:10] - #gives 10 rows all columns

df.iloc[:10, 3] - #gives 10 rows of fourth column

df.iloc[0:10,0:3] - #gives 10 rows with three columns

df.iloc[[21,31,42],0:3] - #gives 21,31,42nd rows with three columns

### Subsetting data

The below is similar type of subsetting with loc

In [ ]:
#loc - without index(With column and row names)

df.loc[:,'firstname']  - #gives the firstname column

df.loc['andrew']  -  #gives all columns in row starts with andrew

df.

### Group by:

groupby is similar to group by in SQL. It groups all the unique elements in particular column.

In [37]:
# using groupby on season and loc to sub set just the 'count':

df.groupby('season').sum().loc[:,['count']]

         count
season
1       312498
2       588282
3       640662
4       544034

#### Merge: 

It is similar to join in SQL. It merges two dataframes on the condition we set

In [ ]:
#merge format: 
pd.merge(df1, df2, 
     how='left', 
     on = 'key',
     left_on=None,
     right_on=None,
     sort=True,
     copy=True)

In [ ]:
#outer join:
pd.merge(df1, df2, how='outer')


#outer join on column 'key'
pd.merge(df1, df2, how= 'outer', on = 'key')

#### Concat:

Concat helps us to combine two dataframes on row basis(axis = 0) or on column basis(axis = 0) irrespective of any common columns or rows

In [ ]:
#concat:

pd.concat([df1, df2, df3], axis = 0) #row concat

pd.concat([df1, df2, df3], axis = 1) #column concat

pd.concat([df1, df2, df3], axis = 1, keys = ['col1', 'col2', 'col3']) #column concat with names of columns as col1,col2,col3

#### Stack - Pivot/Pivot tables:

Stack and pivot helps to change the shape of the data. for example, rows to columns and columns to rows

In [44]:
import numpy as np
df = pd.DataFrame(np.random.randn(4,2), index=[list('MF'*2), list('ABCD')],columns=list('XY'))
df

            X         Y
M A -0.921969  1.465777
F B  0.634382  0.550281
M C -0.135935  1.172830
F D  0.064894 -0.787821

In [46]:
#naming indexes:

df.index.names=['one', 'two']

In [47]:
#stacking and unstacking a dataframe: 

st=df.stack()

st

one  two
M    A    X   -0.921969
          Y    1.465777
F    B    X    0.634382
          Y    0.550281
M    C    X   -0.135935
          Y    1.172830
F    D    X    0.064894
          Y   -0.787821
dtype: float64

In [48]:
st.unstack()

                X         Y
one two
F   B    0.634382  0.550281
    D    0.064894 -0.787821
M   A   -0.921969  1.465777
    C   -0.135935  1.172830

In [50]:
df2 =pd.DataFrame({'date':(list(pd.date_range('2000-01-03', '2000-01-05'))*4), 'item':(list('ABCD'*3)), 
                 'status':(np.random.randn(12))})
df2

         date item    status
0  2000-01-03    A -1.261679
1  2000-01-04    B -0.541725
2  2000-01-05    C  1.820465
3  2000-01-03    D -0.566371
4  2000-01-04    A  0.288838
5  2000-01-05    B -0.224969
6  2000-01-03    C -0.080161
7  2000-01-04    D -1.037800
8  2000-01-05    A  0.762328
9  2000-01-03    B  2.358771
10 2000-01-04    C  1.705071
11 2000-01-05    D  0.116633

In [52]:
#using pivot in this table to reaarange rows and columns

df2.pivot(index='date', columns='item', values='status')

item               A         B         C         D
date
2000-01-03 -1.261679  2.358771 -0.080161 -0.566371
2000-01-04  0.288838 -0.541725  1.705071 -1.037800
2000-01-05  0.762328 -0.224969  1.820465  0.116633

In [56]:
#pivot table helps to do calculation within the dataframe just like excel pivot tables

df2.pivot_table(index='date', columns='item', values='status', aggfunc='mean')

item               A         B         C         D
date
2000-01-03 -1.261679  2.358771 -0.080161 -0.566371
2000-01-04  0.288838 -0.541725  1.705071 -1.037800
2000-01-05  0.762328 -0.224969  1.820465  0.116633

These are some of the pandas concepts which can be helpful to do anytime of EDA

#### ***END***